---
type: BindingMap
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# BindingMap

`Autodesk.Revit.DB.BindingMap` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Clear | — | `public override void Clear ()` |
| Method | Contains | — | `public override bool Contains ( Definition key )` |
| Method | Erase | — | `public override int Erase ( Definition key )` |
| Method | Insert | — | `` |
| Method | ReInsert | — | `` |
| Method | Remove | — | `public virtual bool Remove ( Definition key )` |
| Property | Item | — | `public override Binding this [ Definition key ] { get ; set ; }` |